# <center>Pandas DataFrames</center>
References:
* https://pandas.pydata.org/pandas-docs/stable/10min.html

## 3. Pandas package and DataFrame
- Next to Numpy, Pandas is one of the most widely used Python library
- Two commonly used data structures:
  * **Series**: a one-dimensional labeled array
  * **DataFrame**: two-dimensional labeled data structure with columns
- Labeling
  * **index**: the name of each row
  * **column name**: the name of each column
- Data Frames behave very similar to your Excel tables

### 3.1 Creating DataFrames and viewing data
- Dataframes can be created from 
  * lists
  * numpy arrays
  * dictionaries

In [1]:
# enable interactiveShell
# so that Jupyter will display variables or 
# unassigned output of a statemen 
# without the need for a print statement

from IPython.core.interactiveshell import InteractiveShell
InteractiveShell.ast_node_interactivity = "all"

import pandas as pd

pd.options.display.float_format = '{:,.2f}'.format

In [2]:
# Exercise 3.1.1 Create a Pandas series


# create a series from a list 
# or a one-dimensional array
s=pd.Series(['01','02','10','50','30'])
s

0    01
1    02
2    10
3    50
4    30
dtype: object

In [3]:
# Exercise 3.1.2 Create a Pandas dataframe

import numpy as np

# create a dataframe from a random array
# note the labels for rows (index) and columns names
df = pd.DataFrame(np.random.randint(60,100, (5,4)), \
                  index=s, columns=['A','B','C','D'])
df
# get first two rows
df.head(2)

# get last three rows
df.tail(3)

# get a column 
df.A  # OR df['A']
df['A']
# a column is a series with same indexes

type(df.A)

     A   B   C   D
01  72  85  92  78
02  84  87  79  99
10  72  71  97  71
50  84  60  63  75
30  77  82  82  85

     A   B   C   D
01  72  85  92  78
02  84  87  79  99

     A   B   C   D
10  72  71  97  71
50  84  60  63  75
30  77  82  82  85

01    72
02    84
10    72
50    84
30    77
Name: A, dtype: int64

01    72
02    84
10    72
50    84
30    77
Name: A, dtype: int64

pandas.core.series.Series

In [4]:
# Exercise 3.1.3. add new columns

# add a new column "E"
df["DEPT"]=['CS','BIA','IS','BIA','BIA']
df

     A   B   C   D DEPT
01  72  85  92  78   CS
02  84  87  79  99  BIA
10  72  71  97  71   IS
50  84  60  63  75  BIA
30  77  82  82  85  BIA

In [5]:
# Exercise 3.1.4. View DataFrame index, columns, and values

# df index
print("df index")
df.index

print("\ndf column names")
df.columns

print("\ndf values")
df.values
type(df.values) # values are numpy array
df.values.shape # shape of the array

df.shape

df index

Index(['01', '02', '10', '50', '30'], dtype='object')

df column names

Index(['A', 'B', 'C', 'D', 'DEPT'], dtype='object')

df values

array([[72, 85, 92, 78, 'CS'],
       [84, 87, 79, 99, 'BIA'],
       [72, 71, 97, 71, 'IS'],
       [84, 60, 63, 75, 'BIA'],
       [77, 82, 82, 85, 'BIA']], dtype=object)

numpy.ndarray

(5, 5)

(5, 5)

In [6]:
# Exercise 3.1.5. Show statistics of each column

df.describe()

# Show statistics of only column A
df.describe().A

# the statistics is also a dataframe

          A     B     C     D
count  5.00  5.00  5.00  5.00
mean  77.80 77.00 82.60 81.60
std    6.02 11.34 13.16 10.99
min   72.00 60.00 63.00 71.00
25%   72.00 71.00 79.00 75.00
50%   77.00 82.00 82.00 78.00
75%   84.00 85.00 92.00 85.00
max   84.00 87.00 97.00 99.00

count    5.00
mean    77.80
std      6.02
min     72.00
25%     72.00
50%     77.00
75%     84.00
max     84.00
Name: A, dtype: float64

In [7]:
# Exercise 3.1.6. Transporting dataframe

df.T

      01   02  10   50   30
A     72   84  72   84   77
B     85   87  71   60   82
C     92   79  97   63   82
D     78   99  71   75   85
DEPT  CS  BIA  IS  BIA  BIA

In [8]:
# Exercise 3.1.7. Create a dataframe

x=[(1, 0.8, 'NJ'), (3, 0.7, 'NY'), (2, 0.65, 'PA'),(3, 0.25, 'PA'), \
   (2, 0.32, 'NJ'),(4, 0.95, 'PA'),(1, 0.44, 'NY'), (4, 0.15, 'NY')]

# Create a dataframe from the list of tuples 
# (quarter, income, state)


# show statistics of income column

### 3.2. DataFrame Sorting
- Dataframes can be sorted by
  * index
  * one or more columns

In [9]:
# Exercise 3.2.1. Sorting

# sort by index
df
print("sort by index labels")
df.sort_index(axis=0, ascending=False)

# sort by column names
print("\nsort by column names")
df.sort_index(axis=1, ascending=False)

     A   B   C   D DEPT
01  72  85  92  78   CS
02  84  87  79  99  BIA
10  72  71  97  71   IS
50  84  60  63  75  BIA
30  77  82  82  85  BIA

sort by index labels

     A   B   C   D DEPT
50  84  60  63  75  BIA
30  77  82  82  85  BIA
10  72  71  97  71   IS
02  84  87  79  99  BIA
01  72  85  92  78   CS

sort by column names

   DEPT   D   C   B   A
01   CS  78  92  85  72
02  BIA  99  79  87  84
10   IS  71  97  71  72
50  BIA  75  63  60  84
30  BIA  85  82  82  77

In [10]:
# sort the values by specifc columns
# to sort by A  use by='A'
# for multiple columns, use a list
print("\n1. Sort the values by column A")
df.sort_values(by='A', ascending=False)

print("\n2. Sort the values by columns DEPT and A")
df.sort_values(by=['DEPT','A'], ascending=[True, False])

1. Sort the values by column A

     A   B   C   D DEPT
02  84  87  79  99  BIA
50  84  60  63  75  BIA
30  77  82  82  85  BIA
01  72  85  92  78   CS
10  72  71  97  71   IS

2. Sort the values by columns DEPT and A

     A   B   C   D DEPT
02  84  87  79  99  BIA
50  84  60  63  75  BIA
30  77  82  82  85  BIA
01  72  85  92  78   CS
10  72  71  97  71   IS

In [11]:
# Exercise 3.2.2. Sort the values in the 
# dataframe you created in 3.1.7
# first by state in ascending order, 
# then by quarter in decending order

x=[(1, 0.8, 'NJ'), (3, 0.7, 'NY'), (2, 0.65, 'PA'),(3, 0.25, 'PA'), \
   (2, 0.32, 'NJ'),(4, 0.95, 'PA'),(1, 0.44, 'NY'), (4, 0.15, 'NY')]

### 3.3 Value Selection
- Values can be selected by
  * column names
  * index labels (**loc** property)
  * index position (**iloc** property)
  * indexes and columns together
  * conditions (boolean index)

In [12]:
# Exercise 3.3.1 Selecting columns

# get a specifc column
print("1. Get a specifc column")
df['A']
df.A

# get multiple columns
print("\n2. Get multiple columns")
df[['A','C']]

1. Get a specifc column

01    72
02    84
10    72
50    84
30    77
Name: A, dtype: int64

01    72
02    84
10    72
50    84
30    77
Name: A, dtype: int64

2. Get multiple columns

     A   C
01  72  92
02  84  79
10  72  97
50  84  63
30  77  82

In [69]:
X = pd.DataFrame(np.array([[1, 1, 1], [4, 1, 0], [8, 0, 0.4]]), index=[1, 2, 3], columns=['A', 'B', 'C'])
X

# to get 1 and 1 in the first row
X.iloc[0, 0:2]
X.loc[1, ['A', 'B']]

     A    B    C
1 1.00 1.00 1.00
2 4.00 1.00 0.00
3 8.00 0.00 0.40

A   1.00
B   1.00
Name: 1, dtype: float64

A   1.00
B   1.00
Name: 1, dtype: float64

In [51]:
# Exercise 3.3.2 select rows by index

# get a specific row by index
print("1. Get first row by index label")
df.loc['01']

# get multiple rows by index list
print("2. Get multiple rows by index list")
df.loc[['01','10']]

# The outer bracket is selection and inner bracket is list,
# So if we want to get multiple rows, we need to put all wanted numbers in a list

1. Get first row by index label

A             72
B             85
C             92
D             78
DEPT          CS
PRG     graduate
G              F
Name: 01, dtype: object

2. Get multiple rows by index list

     A   B   C   D DEPT            PRG  G
01  72  85  92  78   CS       graduate  F
10  72  71  97  71   IS  undergraduate  F

In [14]:
# Exercise 3.3.3. select rows by position

# select the first row by position
print("1. Select the first row by position")
df.iloc[0]

# select the first two rows by position
print("2. Select the first two rows by position list")
df.iloc[0:2]

1. Select the first row by position

A       72
B       85
C       92
D       78
DEPT    CS
Name: 01, dtype: object

2. Select the first two rows by position list

     A   B   C   D DEPT
01  72  85  92  78   CS
02  84  87  79  99  BIA

In [15]:
# Exercise 3.3.4. select on multiple axes

# select the 1st and 3rd row, 3rd and 4th columns
# .loc uses the name of the indice or the columns
df.loc[['01','10'], ['C','D']]

# .iloc uses the position of the rows or columns
df.iloc[[0,2], 2:4]

# however, when you iloc, don't use column names, e.g.
# df.iloc[[0,2], ['C','D']]

     C   D
01  92  78
10  97  71

     C   D
01  92  78
10  97  71

In [16]:
# Exercise 3.3.5. 

# Select last three rows, 2nd and 5th columns

In [31]:
# Exercise 3.3.6. Select by condition (Boolean index)

# get data greater than 70
print("Get data where column A is greater than 70")
df.A>70
df[df.A>70]

# get data where A>70 and DEPT='BIA'
# ***don't forget the parentheses () around each condition****
# also note "&", not "and"
print("Get data where A>70 and DEPT='BIA'")
df[(df.A>70) & (df.DEPT=='BIA')]

# See what you get if ignore "()" around the condition
#df[df.A>70 & df.DEPT=='BIA']

# condition on index 
# note the **isin** function to select a range
print("Rows with index in ['01','10','20'] and B>0")
df[(df.index.isin(['01','10','20'])) & (df.B>70)]

Get data where column A is greater than 70

01    True
02    True
10    True
50    True
30    True
Name: A, dtype: bool

     A   B   C   D DEPT            PRG  G
01  72  85  92  78   CS       graduate  F
02  84  87  79  99  BIA  undergraduate  M
10  72  71  97  71   IS  undergraduate  F
50  84  60  63  75  BIA       graduate  F
30  77  82  82  85  BIA       graduate  M

Get data where A>70 and DEPT='BIA'

     A   B   C   D DEPT            PRG  G
02  84  87  79  99  BIA  undergraduate  M
50  84  60  63  75  BIA       graduate  F
30  77  82  82  85  BIA       graduate  M

Rows with index in ['01','10','20'] and B>0

     A   B   C   D DEPT            PRG  G
01  72  85  92  78   CS       graduate  F
10  72  71  97  71   IS  undergraduate  F

### Rules of selecting subsets from dataframes using [ ]  
reference: https://medium.com/dunder-data/selecting-subsets-of-data-in-pandas-39e811c81a0c
* stringreturn a column as a Series, e.g. df['A']
* list of stringsreturn all those columns as a DataFrame, e.g. df[['A','B']]
* a sliceselect rows (can do both label and integer locationconfusing!), e.g. df.loc or df.iloc
* a sequence of booleansselect all rows where True, e.g. df[(df.A>70) & (df.DEPT=='BIA')]

### More about dataframe selection
- Multi-index: 
    - use `loc[(`one`, `two`)]` 
    - use `xs('two', level ='second')`
- Boolean index with conditions
    - If a condition return True/False on **index**, you can use it within `.loc` select rows
    - If a condition return True/False on **column names**, you can use it within `.loc` select columns

In [18]:
x=[(2016, 1, 0.8, 'NJ'), (2017, 1, 0.7, 'NY'), (2016, 2, 0.65, 'PA'),(2016, 1, 0.25, 'PA'), \
   (2016, 2, 0.32, 'NJ'),(2017, 3, 0.95, 'PA'),(2017, 1, 0.44, 'NY'), (2017, 2, 0.15, 'NY')]

x = pd.DataFrame(x, columns = ['Year','Quarter','Income','State'])

x.head()
# create multi-index 
x1 = x.groupby(['State','Year'])['Income'].mean()
x1

   Year  Quarter  Income State
0  2016        1    0.80    NJ
1  2017        1    0.70    NY
2  2016        2    0.65    PA
3  2016        1    0.25    PA
4  2016        2    0.32    NJ

State  Year
NJ     2016   0.56
NY     2017   0.43
PA     2016   0.45
       2017   0.95
Name: Income, dtype: float64

In [19]:
# Select by multiple index
x1.loc[('NJ',2016)]

# select by xs
x1.xs(2016, level ='Year')

0.56

State
NJ   0.56
PA   0.45
Name: Income, dtype: float64

In [33]:
# selection by condition

x = pd.DataFrame([[np.nan, 2, np.nan, 0], [3, 4, 6, 1],
                   [np.nan, np.nan, np.nan, 5], [5, 8, 2, 5]],
                   columns=list('ABCD'))
x
# check missing values**
x1 = x.isnull()
x1

x.isnull().sum(axis=0)

     A    B    C  D
0  NaN 2.00  NaN  0
1 3.00 4.00 6.00  1
2  NaN  NaN  NaN  5
3 5.00 8.00 2.00  5

       A      B      C      D
0   True  False   True  False
1  False  False  False  False
2   True   True   True  False
3  False  False  False  False

A    2
B    1
C    2
D    0
dtype: int64

In [34]:
# find rows that contain any missing values

c1 = x1.any(axis = 1) # .any has 1 True means True
c1    # Note c1 returns True/False on indexes

x1.loc[c1, :]  

x1.loc[x1.isnull().any(axis=1), :]


# .all if all boolean are True then it's True

0     True
1    False
2     True
3    False
dtype: bool

      A      B     C      D
0  True  False  True  False
2  True   True  True  False

Empty DataFrame
Columns: [A, B, C, D]
Index: []

In [22]:
# # find columns that contain any missing values

c2 = x1.any(axis = 0)
c2   # Note c2 return True/False on column names

x1.loc[:, c2]

A     True
B     True
C     True
D    False
dtype: bool

       A      B      C
0   True  False   True
1  False  False  False
2   True   True   True
3  False  False  False

In [23]:
# Exercise 3.3.6. From the dataframe you created in 3.1.7
# 1. select the rows for states NJ and NY and income>0.5


x=[(1, 0.8, 'NJ'), (3, 0.7, 'NY'), (2, 0.65, 'PA'),(3, 0.25, 'PA'), \
   (2, 0.32, 'NJ'),(4, 0.95, 'PA'),(1, 0.44, 'NY'), (4, 0.15, 'NY')]

### 3.4.  Aggregation 
- Dataframes can support aggregation by groups very flexibly
  * count
  * mean
  * sum
  * custom function

In [24]:
# Exercise 3.4.1 value counts 
# get counts of each value in a column
df
df.DEPT.value_counts()

     A   B   C   D DEPT
01  72  85  92  78   CS
02  84  87  79  99  BIA
10  72  71  97  71   IS
50  84  60  63  75  BIA
30  77  82  82  85  BIA

BIA    3
CS     1
IS     1
Name: DEPT, dtype: int64

In [25]:
# Exercise 3.4.2 group by a column and aggregate

grouped=df.groupby('DEPT')
grouped.size()  # get number of rows in each group
grouped.sum()   # sum by group
grouped.mean()  # mean by group

DEPT
BIA    3
CS     1
IS     1
dtype: int64

        A    B    C    D
DEPT
BIA   245  229  224  259
CS     72   85   92   78
IS     72   71   97   71

         A     B     C     D
DEPT
BIA  81.67 76.33 74.67 86.33
CS   72.00 85.00 92.00 78.00
IS   72.00 71.00 97.00 71.00

In [26]:
# Exercise 3.4.3 multiple aggregation function

grouped= df.groupby('DEPT')
grouped['A'].agg([ np.sum, np.mean, np.std, np.argmax])

      sum  mean  std  argmax
DEPT
BIA   245 81.67 4.04       0
CS     72 72.00  NaN       0
IS     72 72.00  NaN       0

In [27]:
# Exercise 3.4.4 grouped by multiple columns 

df['PRG']=['graduate','undergraduate','undergraduate',\
           'graduate','graduate']

df
grouped= df.groupby(['DEPT','PRG'])
grouped.mean()

# note that the groupby columns are 
# indexes now

# to remove multi-indexes
grouped.mean().reset_index()

     A   B   C   D DEPT            PRG
01  72  85  92  78   CS       graduate
02  84  87  79  99  BIA  undergraduate
10  72  71  97  71   IS  undergraduate
50  84  60  63  75  BIA       graduate
30  77  82  82  85  BIA       graduate

                       A     B     C     D
DEPT PRG
BIA  graduate      80.50 71.00 72.50 80.00
     undergraduate 84.00 87.00 79.00 99.00
CS   graduate      72.00 85.00 92.00 78.00
IS   undergraduate 72.00 71.00 97.00 71.00

  DEPT            PRG     A     B     C     D
0  BIA       graduate 80.50 71.00 72.50 80.00
1  BIA  undergraduate 84.00 87.00 79.00 99.00
2   CS       graduate 72.00 85.00 92.00 78.00
3   IS  undergraduate 72.00 71.00 97.00 71.00

### 3.5.  Pivot Table and Cross Tabulation
- Pivot tables or cross tables can be computed easily with pandas
- pivot_table: Calculate pivot tables from a data frame
- crosstab: cross tabulation using any array-like objects (e.g. array, dataframe) 
- Difference between functions pivot_table and cross tabulation
  * pivot_table expects input data to be ** a DataFrame**; 
  * crosstab can use array-like data objects, not necessarily dataframes.
  * for pivot_table, the default aggregation function is **mean**, while for crosstab, the default aggregation function is **count**
- **pivot tables and cross tables are also dataframes**

In [70]:
df

     A   B   C   D DEPT            PRG  G
01  72  85  92  78   CS       graduate  F
02  84  87  79  99  BIA  undergraduate  M
10  72  71  97  71   IS  undergraduate  F
50  84  60  63  75  BIA       graduate  F
30  77  82  82  85  BIA       graduate  M

In [28]:
# Exercise 3.5.1 Pivot table
# for details, see https://pandas.pydata.org/pandas-docs/stable/generated/pandas.pivot_table.html

# parameters: 
# data: data source, 
# values: columns to be aggregated, use a list for multiple columns
# index: keys to group by as pivot table index (row)
# column: keys to group by as pivot table column
# aggfunc: aggregration function. default is mean

# Get mean of column A for students in each DEPT and PRG
pd.pivot_table(data=df, values=['A'], index='DEPT', \
               columns='PRG')

# Pivot by multiple rows or columns

# create a new column
df["G"]=['F','M','F','F','M']
y = pd.pivot_table(data=df, values=['A'], \
    index=['DEPT','G'], columns=['PRG'], aggfunc=np.max)
y
y.describe()
y.index

            A
PRG  graduate undergraduate
DEPT
BIA     80.50         84.00
CS      72.00           NaN
IS        NaN         72.00

              A
PRG    graduate undergraduate
DEPT G
BIA  F    84.00           NaN
     M    77.00         84.00
CS   F    72.00           NaN
IS   F      NaN         72.00

             A
PRG   graduate undergraduate
count     3.00          2.00
mean     77.67         78.00
std       6.03          8.49
min      72.00         72.00
25%      74.50         75.00
50%      77.00         78.00
75%      80.50         81.00
max      84.00         84.00

MultiIndex([('BIA', 'F'),
            ('BIA', 'M'),
            ( 'CS', 'F'),
            ( 'IS', 'F')],
           names=['DEPT', 'G'])

In [29]:
y
y.loc[['BIA']]
y.loc[(:,'F')]

SyntaxError: invalid syntax (3859984531.py, line 3)

In [71]:
df

     A   B   C   D DEPT            PRG  G
01  72  85  92  78   CS       graduate  F
02  84  87  79  99  BIA  undergraduate  M
10  72  71  97  71   IS  undergraduate  F
50  84  60  63  75  BIA       graduate  F
30  77  82  82  85  BIA       graduate  M

In [72]:
# 3.5.2. Get a cross table from a dataframe

# for details, check
# https://pandas.pydata.org/pandas-docs/stable/generated/pandas.crosstab.html
# parameters: 

# index: keys to group by as pivot table index (row)
# columns: keys to group by as pivot table column
# values: columns to be aggregated
# aggfunc: aggregration function. default is count

# count the students in each DEPT and each PRG
pd.crosstab(index=df.DEPT, columns=df.PRG)

# multiple index
pd.crosstab(index=[df.DEPT, df.G], columns=df.PRG)

# Mean of Course A for each DEPT and PRG
pd.crosstab(index=df.DEPT, columns=[df.PRG], values=df.A, \
            aggfunc=np.mean )

PRG   graduate  undergraduate
DEPT
BIA          2              1
CS           1              0
IS           0              1

PRG     graduate  undergraduate
DEPT G
BIA  F         1              0
     M         1              1
CS   F         1              0
IS   F         0              1

PRG   graduate  undergraduate
DEPT
BIA      80.50          84.00
CS       72.00            NaN
IS         NaN          72.00

In [73]:
# 3.5.3. Get a cross table from arrays 
x=np.array([[1,2,10],[3,4,8],[2,2,3],[3,1,4],[1,2,2]])
x
# count of cells by columns 1 and 2
pd.crosstab(index=x[:,0], columns=x[:,1],
           rownames=['col_1'], colnames=['col_2'])

# sum of column 3 by columns 1 and 2
pd.crosstab(index=x[:,0], columns=x[:,1], \
            values=x[:,2], aggfunc=np.sum, \
            rownames=['col_1'], colnames=['col_2'] )

array([[ 1,  2, 10],
       [ 3,  4,  8],
       [ 2,  2,  3],
       [ 3,  1,  4],
       [ 1,  2,  2]])

col_2  1  2  4
col_1
1      0  2  0
2      0  1  0
3      1  0  1

col_2    1     2    4
col_1
1      NaN 12.00  NaN
2      NaN  3.00  NaN
3     4.00   NaN 8.00

In [74]:
# Exercise 3.5.4. group the dataframe you created in 3.1.7


x=[(2016, 0.8, 'NJ'), (2017, 0.7, 'NY'), (2016, 0.65, 'PA'),(2016, 0.25, 'PA'), \
   (2016, 0.32, 'NJ'),(2017, 0.95, 'PA'),(2017, 0.44, 'NY'), (2017, 0.15, 'NY')]

s=pd.DataFrame(x, columns=['year','income', 'state'])

# 1. get the mean and std of income by each state and 
# flatten the index

# 2. sum income by year and state in a pivot table

# 3. get average of income by year and state in a cross/pivot 
# table

### 3.6. Apply function to each row or each column of a dataframe
- The apply function takes each row (axis=1) or each column (axis=0) of the dataframe as an input
- Often **lambda** function (i.e. anonymous function, function without a name) is used
   * lambda function: *<font color='green'>lambda x : expression of x </font>*
   * it can be understood as: *<font color='green'> for x, return expression of x </font>*

In [77]:
# Exercise 3.6.1
# Find the percentage of column A 
# in the sum of columns A-D for each row

df['A_PERC']=df[['A','B','C','D']].apply(lambda row: \
        row['A']/(sum(row)), axis=1)
df
df['A_PERC']
# or you can define a function explicitly
def fun1(row):
    return row["A"]/(sum(row))

df['A_PERC']=df[['A','B','C','D']].apply(fun1, axis=1)
df['A_PERC']

# how to normalize all columns?

     A   B   C   D DEPT            PRG  G  A_PERC
01  72  85  92  78   CS       graduate  F    0.22
02  84  87  79  99  BIA  undergraduate  M    0.24
10  72  71  97  71   IS  undergraduate  F    0.23
50  84  60  63  75  BIA       graduate  F    0.30
30  77  82  82  85  BIA       graduate  M    0.24

01   0.22
02   0.24
10   0.23
50   0.30
30   0.24
Name: A_PERC, dtype: float64

01   0.22
02   0.24
10   0.23
50   0.30
30   0.24
Name: A_PERC, dtype: float64

In [76]:
# For each column, find the percentage of 
# each value in the sum of the column
# i.e. normalize by column
df1=df[['A','B','C','D']].apply(lambda col: col/sum(col),\
                                axis=0)

df1

# note the lambda function cannot be used 
# outside of the apply statement
# you can also assign it to a variable 
# which is the function name!
t=lambda x: x*2
type(t)
t(20)

      A    B    C    D
01 0.19 0.22 0.22 0.19
02 0.22 0.23 0.19 0.24
10 0.19 0.18 0.23 0.17
50 0.22 0.16 0.15 0.18
30 0.20 0.21 0.20 0.21

function

40

### 3.7.  DataFrame concatenate and join
- Dataframes can flexibly concatenated or joined

In [82]:
# Exercise 3.7.1  Concatenate two dateframes
df1 = pd.DataFrame(np.random.randint(0,10, size=(3,2)), \
                   columns=['A','B'])
df1

df2 = pd.DataFrame(np.random.randint(0,10, size=(4,2)), \
                   columns=['A','C'])
df2

# Concatenate two dataframes
pd.concat([df1, df2])

pd.concat([df1, df2], axis=0)
# the new dataframe will have columns A,B,C
# but some portion is NaN (Null)

   A  B
0  4  2
1  6  3
2  9  8

   A  C
0  9  3
1  0  2
2  0  0
3  5  1

   A    B    C
0  4 2.00  NaN
1  6 3.00  NaN
2  9 8.00  NaN
0  9  NaN 3.00
1  0  NaN 2.00
2  0  NaN 0.00
3  5  NaN 1.00

   A    B    C
0  4 2.00  NaN
1  6 3.00  NaN
2  9 8.00  NaN
0  9  NaN 3.00
1  0  NaN 2.00
2  0  NaN 0.00
3  5  NaN 1.00

In [84]:
# Exercise 3.5.2  Merge two dataframes 
# on common columns
df1
df2
pd.merge(df1, df2, on='A')
df1.merge(df2)
# use "on" to join by a specific column

pd.merge(df1, df2, left_on='A', right_on='C', how='outer')
# use "how" to specify inner or outer join

   A  B
0  4  2
1  6  3
2  9  8

   A  C
0  9  3
1  0  2
2  0  0
3  5  1

   A  B  C
0  9  8  3

   A  B  C
0  9  8  3

   A_x    B  A_y    C
0 4.00 2.00  NaN  NaN
1 6.00 3.00  NaN  NaN
2 9.00 8.00  NaN  NaN
3  NaN  NaN 9.00 3.00
4  NaN  NaN 0.00 2.00
5  NaN  NaN 0.00 0.00
6  NaN  NaN 5.00 1.00

### 3.8. Getting Data In/Out

In [ ]:
# Exercise 3.8.1  getting data in/out 

# write dataframe to a csv with header without index
df.to_csv('foo.csv', header=True, index=True)

# read a csv file to a dataframe
# use the first row as header
data=pd.read_csv('foo.csv', header=0)
data

# convert data to a list
data_list=data.values.tolist()
data_list

### Review Exercise

1. Suppose your machine learning model returns a list of probabilities as the output. Write a function to do the following:
    - Given a threshold, say $th$, if a probability > $th$, the prediction is positive; otherwise, negative
    - Compare the prediction with the ground truth labels to calculate the confusion matrix as [[TN, FN],[FP,TP]], where:
        * True Positives (TP): the number of correct positive predictions
        * False Positives (FP): the number of postive predictives which actually are negatives
        * True Negatives (TN): the number of correct negative predictions
        * False Negatives (FN): the number of negative predictives which actually are positives
    - Calculate precision as $TP/(TP+FP)$ and recall as $TP/(TP+FN)$
    - return the confusion matrix, precision, and recall
2. Call this function with $th$ varying from 0.05 to 1 with an increase of 0.05. Plot a line chart to see how precision and recall change by $th$

In [ ]:
prob =np.array([0.28997326, 0.10166073, 0.10759583, 0.0694934 , 0.6767239 ,
       0.01446897, 0.15268748, 0.15570522, 0.12159665, 0.22593857,
       0.98162019, 0.47418329, 0.09376987, 0.80440782, 0.88361167,
       0.21579844, 0.72343069, 0.06605903, 0.15447797, 0.10967575,
       0.93020135, 0.06570391, 0.05283854, 0.09668829, 0.05974545,
       0.04874688, 0.07562255, 0.11103822, 0.71674525, 0.08507381,
       0.630128  , 0.16447478, 0.16914903, 0.1715767 , 0.08040751,
       0.7001173 , 0.04428363, 0.19469664, 0.12247959, 0.14000294,
       0.02411263, 0.26276603, 0.11377073, 0.07055441, 0.2021157 ,
       0.11636899, 0.90348488, 0.10191679, 0.88744523, 0.18938904])

truth = np.array([1, 0, 0, 0, 1, 0, 0, 0, 0, 0, 1, 1, 0, 1, 1, 0, 1, 0, 0, 0, 1, 0,
       0, 0, 0, 0, 0, 0, 1, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
       0, 0, 1, 0, 1, 0])

In [ ]:
def evaluate_performance(prob, truth, th):
    conf = None
    prec = None
    rec = None
    
    # add your code here
    
    
    return conf, prec, rec

In [ ]:
# Test with threhold 0.5
conf, prec, rec = evaluate_performance(prob, truth, th)